Ran Plan for project: `nas.techtales.io` dir: `terraform/nas.techtales.io` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bucket_policies["policy_alex_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/alex/*",
            ]
        }
    }

  # module.bucket_policies["policy_cnpg-kube-lab_cnpg"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::cnpg/kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_cnpg-nas_cnpg"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::cnpg/nas/*",
            ]
        }
    }

  # module.bucket_policies["policy_dominik_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/dominik/*",
            ]
        }
    }

  # module.bucket_policies["policy_jasmin_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/jasmin/*",
            ]
        }
    }

  # module.bucket_policies["policy_loki-kube-lab_loki-kube-lab"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::loki-kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_nils_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/nils/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-discord_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/discord/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-gcloud_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/gcloud/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-github_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/github/techtales-io/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-gworkspace_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/gworkspace/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-harbor_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/harbor/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-minio_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/minio/nas.techtales.io/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-openbao_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/openbao/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-pocket-id_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/pocket-id/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-unifi_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/unifi/*",
            ]
        }
    }

  # module.bucket_policies["policy_tyriis-terraform-github_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/github/tyriis/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-bazarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/bazarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-gatus-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/observability/gatus-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-home-assistant-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/home-assistant-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-jellyfin-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/jellyfin-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-matter-server-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/matter-server-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-matter-server-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-matter-server-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/home-automation/matter-server-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-matter-server-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-matter-server-data-volsync"
+       user_name   = "volsync-kube-lab-matter-server-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-creative-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-creative-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-crowlex-lobby-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-crowlex-lobby-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-lobby-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-lobby-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-playground-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-playground-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-lobby-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-lobby-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-playground-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-playground-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-pvp-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-pvp-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-survival-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-survival-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-velocity-proxy-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-velocity-proxy-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-survival-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-survival-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-velocity-proxy-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-velocity-proxy-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-n8n-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/n8n-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-node-red-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/node-red-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-nzbget-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/nzbget-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-plex-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/plex-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-prowlarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/prowlarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-radarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/radarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-recyclarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/recyclarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-ring-mqtt-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/ring-mqtt-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-sabnzbd-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/sabnzbd-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-seerr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/seerr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-sonarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/sonarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-syncthing-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/productivity/syncthing-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-zigbee2mqtt-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/zigbee2mqtt-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-nas_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/nas/*",
            ]
        }
    }

  # module.users["volsync-kube-lab-matter-server-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-matter-server-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-matter-server-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-matter-server-data"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p nas.techtales.io
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-techtales-io-terraform-minio.techtales.io/lock?id=techtales-io%252Fterraform-minio%252Fterraform%252Fnas.techtales.io%252Fdefault%252Fnas.techtales.io)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p nas.techtales.io
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```